per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input('Введите сумму, которую планируете положить на вклад: '))
deposit = []
for i in per_cent:
    print('Накопленные средства в банке {} за год - '.format(i), int(per_cent[i] * money/100), 'руб.')
    deposit.append(per_cent[i] * money / 100)
print()
deposit_max = max(deposit)
print('Максимальная сумма, которую вы можете заработать - '+ str(int(deposit_max)), 'руб.')

# Вывод на консоль
# Введите сумму, которую планируете положить на вклад: 100000
# Накопленные средства в банке ТКБ за год -  5600 руб.
# Накопленные средства в банке СКБ за год -  5900 руб.
# Накопленные средства в банке ВТБ за год -  4280 руб.
# Накопленные средства в банке СБЕР за год -  4000 руб.
#
# Максимальная сумма, которую вы можете заработать - 5900 руб.
